luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_regdef.h
/**
 * \file IfxMsc_regdef.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XC_UM_V2.2.R1
 * Specification: tc27xC_um_v2.2_SFR.xml (Revision: UM_V2.2)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Msc Msc
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Msc_Bitfields Bitfields
 * \ingroup IfxLld_Msc
 * 
 * \defgroup IfxLld_Msc_union Union
 * \ingroup IfxLld_Msc
 * 
 * \defgroup IfxLld_Msc_struct Struct
 * \ingroup IfxLld_Msc
 * 
 */
#ifndef IFXMSC_REGDEF_H
#define IFXMSC_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Msc_Bitfields
 * \{  */

/** \brief  Asynchronous Block Configuration Register */
typedef struct _Ifx_MSC_ABC_Bits
{
    unsigned int LOW:4;                     /**< \brief [3:0] Duration of the Low Phase of the Shift Clock (rw) */
    unsigned int HIGH:4;                    /**< \brief [7:4] Duration of the High Phase of the Shift Clock (rw) */
    unsigned int OIP:2;                     /**< \brief [9:8] Overflow Interrupt Node Pointer (rw) */
    unsigned int OASR:1;                    /**< \brief [10:10] Overflow Alternate Service Request (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int OVF:1;                     /**< \brief [12:12] Overflow Flag (r) */
    unsigned int OFM:2;                     /**< \brief [14:13] Overflow Flag Modify (w) */
    unsigned int OIE:1;                     /**< \brief [15:15] Overflow Interrupt Enable (rw) */
    unsigned int NDA:3;                     /**< \brief [18:16] N Divider ABRA (rw) */
    unsigned int UIP:2;                     /**< \brief [20:19] Underflow Interrupt Node Pointer (rw) */
    unsigned int UASR:1;                    /**< \brief [21:21] Underflow Alternate Service Request (rw) */
    unsigned int reserved_22:1;             /**< \brief \internal Reserved */
    unsigned int UNF:1;                     /**< \brief [23:23] Underflow Flag (r) */
    unsigned int UFM:2;                     /**< \brief [25:24] Underflow Flag Modify (w) */
    unsigned int UIE:1;                     /**< \brief [26:26] Underflow Interrupt Enable (rw) */
    unsigned int CLKSEL:3;                  /**< \brief [29:27] Clock Select (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int ABB:1;                     /**< \brief [31:31] Asynchronous Block Bypass (rw) */
} Ifx_MSC_ABC_Bits;

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_MSC_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID 0 (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID 1 (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID 2 (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID 3 (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID 4 (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID 5 (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID 6 (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID 7 (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID 8 (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID 9 (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID 10 (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID 11 (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID 12 (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID 13 (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID 14 (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID 15 (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID 16 (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID 17 (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID 18 (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID 19 (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID 20 (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID 21 (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID 22 (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID 23 (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID 24 (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID 25 (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID 26 (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID 27 (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID 28 (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID 29 (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID 30 (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID 31 (rw) */
} Ifx_MSC_ACCEN0_Bits;

