luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_regdef.h
/** \brief  Downstream Select Data Source Low Extension Register */
typedef struct _Ifx_MSC_DSDSLE_Bits
{
    unsigned int SL16:2;                    /**< \brief [1:0] Select Source for SRL (rw) */
    unsigned int SL17:2;                    /**< \brief [3:2] Select Source for SRL (rw) */
    unsigned int SL18:2;                    /**< \brief [5:4] Select Source for SRL (rw) */
    unsigned int SL19:2;                    /**< \brief [7:6] Select Source for SRL (rw) */
    unsigned int SL20:2;                    /**< \brief [9:8] Select Source for SRL (rw) */
    unsigned int SL21:2;                    /**< \brief [11:10] Select Source for SRL (rw) */
    unsigned int SL22:2;                    /**< \brief [13:12] Select Source for SRL (rw) */
    unsigned int SL23:2;                    /**< \brief [15:14] Select Source for SRL (rw) */
    unsigned int SL24:2;                    /**< \brief [17:16] Select Source for SRL (rw) */
    unsigned int SL25:2;                    /**< \brief [19:18] Select Source for SRL (rw) */
    unsigned int SL26:2;                    /**< \brief [21:20] Select Source for SRL (rw) */
    unsigned int SL27:2;                    /**< \brief [23:22] Select Source for SRL (rw) */
    unsigned int SL28:2;                    /**< \brief [25:24] Select Source for SRL (rw) */
    unsigned int SL29:2;                    /**< \brief [27:26] Select Source for SRL (rw) */
    unsigned int SL30:2;                    /**< \brief [29:28] Select Source for SRL (rw) */
    unsigned int SL31:2;                    /**< \brief [31:30] Select Source for SRL (rw) */
} Ifx_MSC_DSDSLE_Bits;

/** \brief  Downstream Status Register */
typedef struct _Ifx_MSC_DSS_Bits
{
    unsigned int PFC:4;                     /**< \brief [3:0] Passive Time Frame Counter (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int NPTF:4;                    /**< \brief [11:8] Number Of Passive Time Frames (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int DC:8;                      /**< \brief [23:16] Downstream Counter (rh) */
    unsigned int DFA:1;                     /**< \brief [24:24] Data Frame Active (rh) */
    unsigned int CFA:1;                     /**< \brief [25:25] Command Frame Active (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_MSC_DSS_Bits;

/** \brief  Downstream Timing Extension Register */
typedef struct _Ifx_MSC_DSTE_Bits
{
    unsigned int PPDE:2;                    /**< \brief [1:0] Passive Phase Length at Data Frames Extension (rw) */
    unsigned int PPCE:6;                    /**< \brief [7:2] Passive Phase Length at Control Frames Extension (rw) */
    unsigned int NDD:4;                     /**< \brief [11:8] N Divider Downstream (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_MSC_DSTE_Bits;

/** \brief  Emergency Stop Register */
typedef struct _Ifx_MSC_ESR_Bits
{
    unsigned int ENL0:1;                    /**< \brief [0:0] Emergency Stop Enable for Bit 0 in SRL (rw) */
    unsigned int ENL1:1;                    /**< \brief [1:1] Emergency Stop Enable for Bit 1 in SRL (rw) */
    unsigned int ENL2:1;                    /**< \brief [2:2] Emergency Stop Enable for Bit 2 in SRL (rw) */
    unsigned int ENL3:1;                    /**< \brief [3:3] Emergency Stop Enable for Bit 3 in SRL (rw) */
    unsigned int ENL4:1;                    /**< \brief [4:4] Emergency Stop Enable for Bit 4 in SRL (rw) */
    unsigned int ENL5:1;                    /**< \brief [5:5] Emergency Stop Enable for Bit 5 in SRL (rw) */
    unsigned int ENL6:1;                    /**< \brief [6:6] Emergency Stop Enable for Bit 6 in SRL (rw) */
    unsigned int ENL7:1;                    /**< \brief [7:7] Emergency Stop Enable for Bit 7 in SRL (rw) */
    unsigned int ENL8:1;                    /**< \brief [8:8] Emergency Stop Enable for Bit 8 in SRL (rw) */
    unsigned int ENL9:1;                    /**< \brief [9:9] Emergency Stop Enable for Bit 9 in SRL (rw) */
    unsigned int ENL10:1;                   /**< \brief [10:10] Emergency Stop Enable for Bit 10 in SRL (rw) */
    unsigned int ENL11:1;                   /**< \brief [11:11] Emergency Stop Enable for Bit 11 in SRL (rw) */
    unsigned int ENL12:1;                   /**< \brief [12:12] Emergency Stop Enable for Bit 12 in SRL (rw) */
    unsigned int ENL13:1;                   /**< \brief [13:13] Emergency Stop Enable for Bit 13 in SRL (rw) */
    unsigned int ENL14:1;                   /**< \brief [14:14] Emergency Stop Enable for Bit 14 in SRL (rw) */
    unsigned int ENL15:1;                   /**< \brief [15:15] Emergency Stop Enable for Bit 15 in SRL (rw) */
    unsigned int ENH0:1;                    /**< \brief [16:16] Emergency Stop Enable for Bit 0 in SRH (rw) */
    unsigned int ENH1:1;                    /**< \brief [17:17] Emergency Stop Enable for Bit 1 in SRH (rw) */
    unsigned int ENH2:1;                    /**< \brief [18:18] Emergency Stop Enable for Bit 2 in SRH (rw) */
    unsigned int ENH3:1;                    /**< \brief [19:19] Emergency Stop Enable for Bit 3 in SRH (rw) */
    unsigned int ENH4:1;                    /**< \brief [20:20] Emergency Stop Enable for Bit 4 in SRH (rw) */
    unsigned int ENH5:1;                    /**< \brief [21:21] Emergency Stop Enable for Bit 5 in SRH (rw) */
    unsigned int ENH6:1;                    /**< \brief [22:22] Emergency Stop Enable for Bit 6 in SRH (rw) */
    unsigned int ENH7:1;                    /**< \brief [23:23] Emergency Stop Enable for Bit 7 in SRH (rw) */
    unsigned int ENH8:1;                    /**< \brief [24:24] Emergency Stop Enable for Bit 8 in SRH (rw) */
    unsigned int ENH9:1;                    /**< \brief [25:25] Emergency Stop Enable for Bit 9 in SRH (rw) */
    unsigned int ENH10:1;                   /**< \brief [26:26] Emergency Stop Enable for Bit 10 in SRH (rw) */
    unsigned int ENH11:1;                   /**< \brief [27:27] Emergency Stop Enable for Bit 11 in SRH (rw) */
    unsigned int ENH12:1;                   /**< \brief [28:28] Emergency Stop Enable for Bit 12 in SRH (rw) */
    unsigned int ENH13:1;                   /**< \brief [29:29] Emergency Stop Enable for Bit 13 in SRH (rw) */
    unsigned int ENH14:1;                   /**< \brief [30:30] Emergency Stop Enable for Bit 14 in SRH (rw) */
    unsigned int ENH15:1;                   /**< \brief [31:31] Emergency Stop Enable for Bit 15 in SRH (rw) */
} Ifx_MSC_ESR_Bits;

/** \brief  Emergency Stop Extension Register */
typedef struct _Ifx_MSC_ESRE_Bits
{
    unsigned int ENL16:1;                   /**< \brief [0:0] Emergency Stop Enable for Bit 16 in SRL (rw) */
    unsigned int ENL17:1;                   /**< \brief [1:1] Emergency Stop Enable for Bit 17 in SRL (rw) */
    unsigned int ENL18:1;                   /**< \brief [2:2] Emergency Stop Enable for Bit 18 in SRL (rw) */
    unsigned int ENL19:1;                   /**< \brief [3:3] Emergency Stop Enable for Bit 19 in SRL (rw) */
    unsigned int ENL20:1;                   /**< \brief [4:4] Emergency Stop Enable for Bit 20 in SRL (rw) */
    unsigned int ENL21:1;                   /**< \brief [5:5] Emergency Stop Enable for Bit 21 in SRL (rw) */
    unsigned int ENL22:1;                   /**< \brief [6:6] Emergency Stop Enable for Bit 22 in SRL (rw) */
    unsigned int ENL23:1;                   /**< \brief [7:7] Emergency Stop Enable for Bit 23 in SRL (rw) */
    unsigned int ENL24:1;                   /**< \brief [8:8] Emergency Stop Enable for Bit 24 in SRL (rw) */
    unsigned int ENL25:1;                   /**< \brief [9:9] Emergency Stop Enable for Bit 25 in SRL (rw) */
    unsigned int ENL26:1;                   /**< \brief [10:10] Emergency Stop Enable for Bit 26 in SRL (rw) */
    unsigned int ENL27:1;                   /**< \brief [11:11] Emergency Stop Enable for Bit 27 in SRL (rw) */
    unsigned int ENL28:1;                   /**< \brief [12:12] Emergency Stop Enable for Bit 28 in SRL (rw) */
    unsigned int ENL29:1;                   /**< \brief [13:13] Emergency Stop Enable for Bit 29 in SRL (rw) */
    unsigned int ENL30:1;                   /**< \brief [14:14] Emergency Stop Enable for Bit 30 in SRL (rw) */
    unsigned int ENL31:1;                   /**< \brief [15:15] Emergency Stop Enable for Bit 31 in SRL (rw) */
    unsigned int ENH16:1;                   /**< \brief [16:16] Emergency Stop Enable for Bit 16 in SRH (rw) */
    unsigned int ENH17:1;                   /**< \brief [17:17] Emergency Stop Enable for Bit 17 in SRH (rw) */
    unsigned int ENH18:1;                   /**< \brief [18:18] Emergency Stop Enable for Bit 18 in SRH (rw) */
    unsigned int ENH19:1;                   /**< \brief [19:19] Emergency Stop Enable for Bit 19 in SRH (rw) */
    unsigned int ENH20:1;                   /**< \brief [20:20] Emergency Stop Enable for Bit 20 in SRH (rw) */
    unsigned int ENH21:1;                   /**< \brief [21:21] Emergency Stop Enable for Bit 21 in SRH (rw) */
    unsigned int ENH22:1;                   /**< \brief [22:22] Emergency Stop Enable for Bit 22 in SRH (rw) */
    unsigned int ENH23:1;                   /**< \brief [23:23] Emergency Stop Enable for Bit 23 in SRH (rw) */
    unsigned int ENH24:1;                   /**< \brief [24:24] Emergency Stop Enable for Bit 24 in SRH (rw) */
    unsigned int ENH25:1;                   /**< \brief [25:25] Emergency Stop Enable for Bit 25 in SRH (rw) */
    unsigned int ENH26:1;                   /**< \brief [26:26] Emergency Stop Enable for Bit 26 in SRH (rw) */
    unsigned int ENH27:1;                   /**< \brief [27:27] Emergency Stop Enable for Bit 27 in SRH (rw) */
    unsigned int ENH28:1;                   /**< \brief [28:28] Emergency Stop Enable for Bit 28 in SRH (rw) */
    unsigned int ENH29:1;                   /**< \brief [29:29] Emergency Stop Enable for Bit 29 in SRH (rw) */
    unsigned int ENH30:1;                   /**< \brief [30:30] Emergency Stop Enable for Bit 30 in SRH (rw) */
    unsigned int ENH31:1;                   /**< \brief [31:31] Emergency Stop Enable for Bit 31 in SRH (rw) */
} Ifx_MSC_ESRE_Bits;

/** \brief  Fractional Divider Register */
typedef struct _Ifx_MSC_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:4;             /**< \brief \internal Reserved */
    unsigned int ENHW:1;                    /**< \brief [30:30] Enable Hardware Clock Control (rw) */
    unsigned int DISCLK:1;                  /**< \brief [31:31] Disable Clock (rwh) */
} Ifx_MSC_FDR_Bits;

/** \brief  Interrupt Control Register */
typedef struct _Ifx_MSC_ICR_Bits
{
    unsigned int EDIP:2;                    /**< \brief [1:0] Data Frame Interrupt Node Pointer (rw) */
    unsigned int EDIE:2;                    /**< \brief [3:2] Data Frame Interrupt Enable (rw) */
    unsigned int ECIP:2;                    /**< \brief [5:4] Command Frame Interrupt Node Pointer (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int ECIE:1;                    /**< \brief [7:7] Command Frame Interrupt Enable (rw) */
    unsigned int TFIP:2;                    /**< \brief [9:8] Time Frame Interrupt Pointer (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int TFIE:1;                    /**< \brief [11:11] Time Frame Interrupt Enable (rw) */
    unsigned int RDIP:2;                    /**< \brief [13:12] Receive Data Interrupt Pointer (rw) */
    unsigned int RDIE:2;                    /**< \brief [15:14] Receive Data Interrupt Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_MSC_ICR_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_MSC_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_MSC_ID_Bits;

/** \brief  Interrupt Set Clear Register */
typedef struct _Ifx_MSC_ISC_Bits
{
    unsigned int CDEDI:1;                   /**< \brief [0:0] Clear DEDI Flag (w) */
    unsigned int CDECI:1;                   /**< \brief [1:1] Clear DECI Flag (w) */
    unsigned int CDTFI:1;                   /**< \brief [2:2] Clear DTFI Flag (w) */
    unsigned int CURDI:1;                   /**< \brief [3:3] Clear URDI Flag (w) */
    unsigned int CDP:1;                     /**< \brief [4:4] Clear DP Flag (w) */
    unsigned int CCP:1;                     /**< \brief [5:5] Clear CP Flag (w) */
    unsigned int CDDIS:1;                   /**< \brief [6:6] Clear DSDIS Flag (w) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int SDEDI:1;                   /**< \brief [16:16] Set DEDI Flag (w) */
    unsigned int SDECI:1;                   /**< \brief [17:17] Set DECI Flag (w) */
    unsigned int SDTFI:1;                   /**< \brief [18:18] Set DTFI Flag (w) */
    unsigned int SURDI:1;                   /**< \brief [19:19] Set URDI Flag (w) */
    unsigned int SDP:1;                     /**< \brief [20:20] Set DP Bit (w) */
    unsigned int SCP:1;                     /**< \brief [21:21] Set CP Flag (w) */
    unsigned int SDDIS:1;                   /**< \brief [22:22] Set DSDIS Flag (w) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_MSC_ISC_Bits;

/** \brief  Interrupt Status Register */
typedef struct _Ifx_MSC_ISR_Bits
{
    unsigned int DEDI:1;                    /**< \brief [0:0] Data Frame Interrupt Flag (rh) */
    unsigned int DECI:1;                    /**< \brief [1:1] Command Frame Interrupt Flag (rh) */
    unsigned int DTFI:1;                    /**< \brief [2:2] Time Frame Interrupt Flag (rh) */
    unsigned int URDI:1;                    /**< \brief [3:3] Receive Data Interrupt Flag (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_MSC_ISR_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_MSC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_MSC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST1_Bits;

