luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxMsc_regdef.h
/** \brief  Downstream Command Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DC_Bits B;                      /**< \brief Bitfield access */
} Ifx_MSC_DC;

/** \brief  Downstream Data Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DD_Bits B;                      /**< \brief Bitfield access */
} Ifx_MSC_DD;

/** \brief  Downstream Data Extension Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DDE_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_DDE;

/** \brief  Downstream Data Mirror Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DDM_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_DDM;

/** \brief  Downstream Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSC_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_DSC;

/** \brief  Downstream Control Enhanced Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSCE_Bits B;                    /**< \brief Bitfield access */
} Ifx_MSC_DSCE;

/** \brief  Downstream Select Data Source High Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSDSH_Bits B;                   /**< \brief Bitfield access */
} Ifx_MSC_DSDSH;

/** \brief  Downstream Select Data Source High Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSDSHE_Bits B;                  /**< \brief Bitfield access */
} Ifx_MSC_DSDSHE;

/** \brief  Downstream Select Data Source Low Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSDSL_Bits B;                   /**< \brief Bitfield access */
} Ifx_MSC_DSDSL;

/** \brief  Downstream Select Data Source Low Extension Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSDSLE_Bits B;                  /**< \brief Bitfield access */
} Ifx_MSC_DSDSLE;

/** \brief  Downstream Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSS_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_DSS;

/** \brief  Downstream Timing Extension Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_DSTE_Bits B;                    /**< \brief Bitfield access */
} Ifx_MSC_DSTE;

/** \brief  Emergency Stop Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ESR_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_ESR;

/** \brief  Emergency Stop Extension Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ESRE_Bits B;                    /**< \brief Bitfield access */
} Ifx_MSC_ESRE;

/** \brief  Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_FDR_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_FDR;

/** \brief  Interrupt Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ICR_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_ICR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ID_Bits B;                      /**< \brief Bitfield access */
} Ifx_MSC_ID;

/** \brief  Interrupt Set Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ISC_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_ISC;

/** \brief  Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_ISR_Bits B;                     /**< \brief Bitfield access */
} Ifx_MSC_ISR;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_KRST0_Bits B;                   /**< \brief Bitfield access */
} Ifx_MSC_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_MSC_KRST1_Bits B;                   /**< \brief Bitfield access */
} Ifx_MSC_KRST1;

